In [22]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
from sklearn.preprocessing import LabelEncoder
import collections

In [23]:
data_folder = '../../data/raif/'

In [24]:
data = pd.read_csv(os.path.join(data_folder, 'transactions_last_2.csv'), delimiter=';')

In [25]:
data.head()

,purchdate,amount,mcc,mrchcity,mrchname,cnum
0,2019-11-02 00:00:00,9000000.0,5691,MOSCOW,IA7D1H Z1D1T7,MJNLMQ
1,2019-11-02 00:00:00,9000000.0,5691,MOSCOW,IA7D1H Z1D1T7,MJNLMQ
2,2019-10-25 00:00:00,7716900.0,5691,MOSCOW,HXL4K TL4EEXD,ELETCO
3,2019-11-29 00:00:00,5100000.0,6513,SANKT-PETERBU,7X 1E7HXD H1DKW1IKCL,EL0KSF
4,2019-12-03 00:00:00,5023956.6,5944,MOSKVA,73 7HJXK7 (W7X),MPKIJJ

In [26]:
data.shape

(104161408, 6)

In [27]:
data['cnum'].nunique()

1355925

In [28]:
status =  pd.read_csv(os.path.join(data_folder, 'clients_last_2_fixed.csv'), delimiter=';')

In [29]:
status.head()

    cnum_  categorycode gender  age     married_ residenttype
0  0CCCDO            81      M   32  not_married            R
1  0CCCFO            70      F   42  not_married            R
2  0CCCGC            50      F   33      married            R
3  0CCCGG            70      M   58  not_married            R
4  0CCCGO            60      M   38      married            R

In [30]:
status['cnum_'].nunique()

1355925

In [31]:
status['married_'].unique()

array(['not_married', 'married'], dtype=object)

### Balancing number of married / not_married id

In [32]:
status['married_'].value_counts() / len(status) * 100

not_married    64.433579
married        35.566421
Name: married_, dtype: float64

In [33]:
status.groupby('gender')['married_'].value_counts() / len(status) * 100

gender  married_
F       not_married    32.564117
        married        14.673599
M       not_married    31.869462
        married        20.892822
Name: married_, dtype: float64

### Composing transaction histories for each id

In [34]:
data.head()

,purchdate,amount,mcc,mrchcity,mrchname,cnum
0,2019-11-02 00:00:00,9000000.0,5691,MOSCOW,IA7D1H Z1D1T7,MJNLMQ
1,2019-11-02 00:00:00,9000000.0,5691,MOSCOW,IA7D1H Z1D1T7,MJNLMQ
2,2019-10-25 00:00:00,7716900.0,5691,MOSCOW,HXL4K TL4EEXD,ELETCO
3,2019-11-29 00:00:00,5100000.0,6513,SANKT-PETERBU,7X 1E7HXD H1DKW1IKCL,EL0KSF
4,2019-12-03 00:00:00,5023956.6,5944,MOSKVA,73 7HJXK7 (W7X),MPKIJJ

In [35]:
data['mcc'].nunique()

394

In [36]:
data.shape

(104161408, 6)

In [37]:
data.head()

,purchdate,amount,mcc,mrchcity,mrchname,cnum
0,2019-11-02 00:00:00,9000000.0,5691,MOSCOW,IA7D1H Z1D1T7,MJNLMQ
1,2019-11-02 00:00:00,9000000.0,5691,MOSCOW,IA7D1H Z1D1T7,MJNLMQ
2,2019-10-25 00:00:00,7716900.0,5691,MOSCOW,HXL4K TL4EEXD,ELETCO
3,2019-11-29 00:00:00,5100000.0,6513,SANKT-PETERBU,7X 1E7HXD H1DKW1IKCL,EL0KSF
4,2019-12-03 00:00:00,5023956.6,5944,MOSKVA,73 7HJXK7 (W7X),MPKIJJ

In [38]:
encoder = LabelEncoder()
data['mcc'] = encoder.fit_transform(data['mcc'])

In [39]:
collections.Counter(data['mcc'].values)

Counter({214: 835252,
         286: 6689,
         247: 81506,
         197: 342612,
         193: 95842,
         176: 409470,
         332: 71624,
         194: 18566,
         224: 197278,
         186: 669639,
         210: 622477,
         251: 26243,
         391: 216019,
         138: 157373,
         140: 33609,
         377: 72029,
         325: 364880,
         370: 354523,
         285: 226576,
         280: 3353,
         282: 5086225,
         237: 2678962,
         379: 64962,
         35: 1057,
         162: 6144,
         289: 191291,
         217: 94634,
         284: 3846,
         359: 84344,
         149: 537887,
         346: 191388,
         392: 337597,
         372: 6503,
         187: 27053381,
         26: 1158,
         218: 177917,
         229: 3646236,
         279: 1192023,
         20: 72109,
         225: 5250,
         213: 6394,
         335: 9533,
         239: 762,
         133: 77439,
         308: 196105,
         184: 678548,
         192: 5821330,
         198: 2948285,
         230: 301963,
         223: 226759,
         206: 32174,
         360: 113068,
         324: 75277,
         253: 8189,
         178: 48408,
         175: 856752,
         373: 19545,
         207: 141144,
         387: 367214,
         70: 2073,
         357: 216441,
         222: 78347,
         152: 20216,
         244: 240163,
         212: 254255,
         10: 2070,
         16: 391,
         269: 819372,
         361: 84829,
         185: 890613,
         202: 1368,
         227: 914834,
         245: 351446,
         172: 24208,
         298: 380112,
         368: 34320,
         287: 851824,
         3: 140,
         211: 20400,
         350: 50693,
         182: 47648,
         355: 292909,
         219: 3415,
         220: 34417,
         143: 150561,
         49: 57,
         281: 6563269,
         177: 8071,
         374: 1913,
         66: 1814,
         365: 58084,
         389: 148570,
         97: 990,
         250: 121703,
         378: 2977,
         307: 69749,
         369: 17606,
         150: 5280,
         272: 276374,
         82: 603,
         205: 1564,
         17: 1314,
         151: 1605,
         114: 7,
         160: 5241,
         209: 223813,
         142: 54292,
         264: 3683,
         256: 815,
         231: 13208780,
         283: 72893,
         288: 45607,
         252: 42410,
         249: 8839,
         46: 544,
         156: 3953,
         145: 327210,
         4: 1819,
         228: 37463,
         47: 524,
         154: 8492,
         236: 3125257,
         19: 1668,
         40: 60,
         48: 71,
         29: 81,
         273: 416266,
         215: 9208,
         234: 22561,
         71: 109,
         18: 4849,
         52: 50,
         7: 826,
         158: 3473,
         262: 4211,
         179: 53604,
         255: 7,
         55: 3,
         208: 52558,
         43: 41,
         33: 1864,
         112: 412,
         181: 2146,
         30: 459,
         68: 395,
         254: 2527,
         221: 568,
         388: 1406,
         155: 2000,
         317: 29242,
         132: 14303,
         39: 258,
         124: 3,
         309: 139170,
         101: 1596,
         233: 567940,
         5: 2217,
         364: 4369,
         354: 85346,
         200: 348,
         329: 2712,
         42: 52,
         383: 1778,
         371: 4949,
         319: 2062,
         135: 408,
         381: 4354,
         246: 165231,
         341: 11645,
         352: 190,
         21: 975,
         139: 1777,
         248: 424738,
         300: 1296,
         128: 225300,
         393: 85442,
         320: 2554,
         367: 6497,
         345: 8986,
         380: 2710,
         13: 286,
         11: 4230,
         243: 1803,
         240: 1985,
         167: 7623,
         79: 2785,
         275: 419419,
         268: 11118,
         235: 11591,
         105: 2,
         351: 52994,
         159: 3407,
         276: 942,
         2: 2309,
         37: 1377,
         173: 1436,
         263: 9165,
         238: 13017,
         6: 44,
         153: 2352,
         56: 551,
         226: 27850,
         134: 3118,
         50: 383,
         157: 406,
         169: 1215,
         343: 302061,
         333: 114046,
         336: 170,
         38: 37,
         295: 36192,
         53: 19,
         126: 341,
         111: 484,
         323: 19111,
         87: 2204,
         99: 858,
         92: 1072,
         165: 13432,
         356: 31741,
         304: 41925,
         130: 4493604,
         129: 55,
         22: 660,
         148: 55811,
         161: 887,
         147: 69,
         31: 283,
         196: 18044,
         58: 299,
         32: 20,
         265: 554,
         376: 801,
         183: 19410,
         349: 7942,
         274: 2782,
         338: 1749,
         321: 5962,
         96: 588,
         23: 176,
         80: 5,
         188: 66559,
         328: 206179,
         89: 212,
         257: 205836,
         14: 78,
         59: 237,
         171: 84318,
         163: 1167,
         15: 149,
         166: 14123,
         375: 664,
         330: 4522,
         74: 18,
         306: 2609,
         144: 532976,
         201: 49,
         277: 94,
         0: 36538,
         8: 352,
         266: 5294,
         216: 404,
         318: 5260,
         362: 37,
         118: 540,
         337: 3133,
         69: 920,
         62: 12,
         110: 243,
         174: 1959,
         78: 1147,
         347: 3628,
         127: 2783917,
         270: 470,
         291: 838,
         271: 9531,
         36: 7,
         123: 57,
         91: 1026,
         331: 140,
         267: 116,
         303: 179,
         322: 1269,
         297: 32229,
         137: 47,
         311: 890,
         168: 1799,
         189: 180696,
         108: 398,
         115: 6,
         86: 3,
         60: 8,
         385: 60,
         67: 8,
         312: 5940,
         191: 318273,
         90: 6,
         259: 12,
         61: 76,
         299: 2516,
         120: 231,
         77: 12,
         261: 107130,
         386: 745,
         119: 1,
         141: 286832,
         232: 23940,
         278: 752,
         116: 1,
         98: 8,
         51: 18,
         65: 5,
         315: 9449,
         358: 1933,
         83: 1,
         305: 94,
         339: 101,
         109: 15,
         85: 6,
         242: 60,
         342: 1302,
         258: 840,
         310: 789,
         164: 14949,
         104: 36,
         117: 4,
         28: 26,
         353: 6020,
         54: 2,
         131: 2382571,
         293: 10836,
         290: 44,
         316: 1410,
         384: 43,
         75: 1,
         190: 56999,
         41: 6,
         27: 23,
         95: 1,
         348: 1372,
         136: 432,
         84: 2,
         366: 36,
         1: 133,
         64: 1,
         100: 1,
         390: 12,
         106: 2,
         260: 1479,
         195: 78,
         326: 1,
         93: 3,
         382: 80,
         199: 95353,
         45: 7,
         292: 1376,
         44: 2,
         12: 159,
         340: 17,
         103: 4,
         301: 9759,
         121: 1,
         294: 965,
         24: 5,
         313: 63,
         344: 98412,
         296: 470,
         57: 8,
         94: 1,
         204: 29,
         73: 2,
         25: 5,
         81: 1,
         125: 1,
         122: 12,
         88: 2,
         170: 322,
         9: 1,
         327: 1361,
         34: 3,
         76: 1,
         334: 3,
         302: 97,
         180: 10,
         63: 1,
         107: 1,
         72: 2,
         363: 1,
         203: 1,
         241: 2,
         314: 16,
         102: 1,
         113: 1,
         146: 2})

In [20]:
len(np.unique(data['mcc']))

394

In [21]:
np.max(data['mcc'])

393

In [185]:
data['purchdate'] = pd.to_datetime(data['purchdate'], format='%Y-%m-%d %H:%M:%S')

In [186]:
data.head()

   purchdate     amount  mcc       mrchcity              mrchname    cnum
0 2019-11-02  9000000.0  214         MOSCOW         IA7D1H Z1D1T7  MJNLMQ
1 2019-11-02  9000000.0  214         MOSCOW         IA7D1H Z1D1T7  MJNLMQ
2 2019-10-25  7716900.0  214         MOSCOW         HXL4K TL4EEXD  ELETCO
3 2019-11-29  5100000.0  286  SANKT-PETERBU  7X 1E7HXD H1DKW1IKCL  EL0KSF
4 2019-12-03  5023956.6  247         MOSKVA       73 7HJXK7 (W7X)  MPKIJJ

In [187]:
data.sort_values(by='purchdate', inplace=True)

In [188]:
data.head()

          purchdate  amount  mcc       mrchcity              mrchname    cnum
46308876 2019-09-01   428.2  236     N.NOVGOROD  7WE1IADOO WLD3E MBV5  EEUMYJ
99913237 2019-09-01    30.0  231          KIROV        Trwhmwc-Talunl  ELNJV5
99913235 2019-09-01    30.0  231          KIROV        Trwhmwc-Talunl  ELNJV5
24234483 2019-09-01  1140.0  130  SANKT-PETERBU           ZHX07H 7TEX  EE01QH
99913230 2019-09-01    30.0  231          KIROV        Trwhmwc-Talunl  ELNJV5

In [189]:
df = data.groupby('cnum')['mcc'].agg(lambda x: list(x))

In [190]:
df = pd.DataFrame(df)
df.reset_index(inplace=True)

In [191]:
df.head()

     cnum                                                mcc
0  0CCCDO  [269, 187, 166, 282, 212, 282, 208, 269, 187, ...
1  0CCCFO                               [281, 281, 281, 281]
2  0CCCGC  [187, 192, 187, 198, 127, 231, 231, 229, 187, ...
3  0CCCGG  [187, 198, 187, 198, 127, 187, 187, 198, 187, ...
4  0CCCGO  [187, 187, 130, 130, 236, 187, 231, 231, 187, ...

In [192]:
df = df.merge(status, how='inner', left_on='cnum', right_on='cnum_')

In [193]:
df = df[['cnum', 'mcc', 'married_']]

In [194]:
df.head()

     cnum                                                mcc     married_
0  0CCCDO  [269, 187, 166, 282, 212, 282, 208, 269, 187, ...  not_married
1  0CCCFO                               [281, 281, 281, 281]  not_married
2  0CCCGC  [187, 192, 187, 198, 127, 231, 231, 229, 187, ...      married
3  0CCCGG  [187, 198, 187, 198, 127, 187, 187, 198, 187, ...  not_married
4  0CCCGO  [187, 187, 130, 130, 236, 187, 231, 231, 187, ...      married

In [195]:
df['married_'] = df['married_'].map({'not_married': 0, 'married': 1})

In [196]:
df.head()

     cnum                                                mcc  married_
0  0CCCDO  [269, 187, 166, 282, 212, 282, 208, 269, 187, ...         0
1  0CCCFO                               [281, 281, 281, 281]         0
2  0CCCGC  [187, 192, 187, 198, 127, 231, 231, 229, 187, ...         1
3  0CCCGG  [187, 198, 187, 198, 127, 187, 187, 198, 187, ...         0
4  0CCCGO  [187, 187, 130, 130, 236, 187, 231, 231, 187, ...         1

In [197]:
df.shape

(1355925, 3)

In [198]:
all_l = []
for i in range(len(df)):
    all_l.append(len(df.loc[i, 'mcc']))

In [199]:
np.median(all_l)

36.0

In [200]:
np.max(all_l)

2690

In [201]:
np.quantile(all_l, 0.3)

12.0

In [202]:
df = df.loc[df['mcc'].apply(lambda x: len(x)) >= 10]

In [203]:
df.shape

(993528, 3)

In [204]:
df.head()

     cnum                                                mcc  married_
0  0CCCDO  [269, 187, 166, 282, 212, 282, 208, 269, 187, ...         0
2  0CCCGC  [187, 192, 187, 198, 127, 231, 231, 229, 187, ...         1
3  0CCCGG  [187, 198, 187, 198, 127, 187, 187, 198, 187, ...         0
4  0CCCGO  [187, 187, 130, 130, 236, 187, 231, 231, 187, ...         1
5  0CCCGS  [187, 187, 187, 130, 325, 229, 359, 187, 127, ...         0

In [205]:
df['mcc'] = df['mcc'].apply(lambda x: x[-200:])

In [206]:
df.head()

     cnum                                                mcc  married_
0  0CCCDO  [269, 187, 166, 282, 212, 282, 208, 269, 187, ...         0
2  0CCCGC  [187, 192, 187, 198, 127, 231, 231, 229, 187, ...         1
3  0CCCGG  [187, 198, 187, 198, 127, 187, 187, 198, 187, ...         0
4  0CCCGO  [131, 231, 187, 231, 231, 231, 187, 231, 231, ...         1
5  0CCCGS  [289, 229, 325, 128, 130, 130, 130, 187, 192, ...         0

In [207]:
df.rename({'cnum': 'id', 'married_': 'target'}, axis=1, inplace=True)

In [208]:
df.head()

       id                                                mcc  target
0  0CCCDO  [269, 187, 166, 282, 212, 282, 208, 269, 187, ...       0
2  0CCCGC  [187, 192, 187, 198, 127, 231, 231, 229, 187, ...       1
3  0CCCGG  [187, 198, 187, 198, 127, 187, 187, 198, 187, ...       0
4  0CCCGO  [131, 231, 187, 231, 231, 231, 187, 231, 231, ...       1
5  0CCCGS  [289, 229, 325, 128, 130, 130, 130, 187, 192, ...       0

In [209]:
df['target'].value_counts()

0    632738
1    360790
Name: target, dtype: int64

In [210]:
zero_id = df.loc[df['target']==0]['id']

In [211]:
one_id = df.loc[df['target']==1]['id']

In [212]:
reduced_zero_id = np.random.choice(zero_id, size=len(df.loc[df['target']==1]), replace=False)

In [213]:
df = df.loc[df['id'].isin(list(one_id)+list(reduced_zero_id))]

In [214]:
df.head()

       id                                                mcc  target
0  0CCCDO  [269, 187, 166, 282, 212, 282, 208, 269, 187, ...       0
2  0CCCGC  [187, 192, 187, 198, 127, 231, 231, 229, 187, ...       1
4  0CCCGO  [131, 231, 187, 231, 231, 231, 187, 231, 231, ...       1
5  0CCCGS  [289, 229, 325, 128, 130, 130, 130, 187, 192, ...       0
6  0CCCHG  [370, 214, 187, 187, 187, 229, 187, 187, 130, ...       1

In [215]:
df.reset_index(inplace=True, drop=True)

In [216]:
df['target'].sum() / len(df) * 100

50.0

In [217]:
df = df.sample(frac=1).reset_index(drop=True)

In [218]:
df.shape

(721580, 3)

In [219]:
df.head()

       id                                                mcc  target
0  EXCSSG  [184, 185, 187, 236, 175, 187, 187, 236, 236, ...       0
1  8E4SUG  [187, 231, 187, 187, 185, 231, 187, 231, 187, ...       0
2  RTPLNJ  [198, 192, 231, 282, 198, 282, 236, 231, 231, ...       1
3  TMKMKL  [281, 281, 187, 187, 279, 187, 187, 187, 187, ...       1
4  4HDXOX  [187, 192, 223, 365, 365, 192, 192, 187, 187, ...       0

In [220]:
df['target'].sum() / len(df)

0.5

### Train-valid-test split

In [221]:
all_id = df['id'].values

In [222]:
train_id = all_id[:int(0.7 * len(all_id))]
valid_id = all_id[int(0.7 * len(all_id)):int(0.8 * len(all_id))]
test_id = all_id[int(0.8 * len(all_id)):]

In [223]:
train_df = df.loc[df['id'].isin(train_id)]
valid_df = df.loc[df['id'].isin(valid_id)]
test_df = df.loc[df['id'].isin(test_id)]

In [228]:
train_df['target'].sum() / len(train_df), valid_df['target'].sum() / len(valid_df), \
test_df['target'].sum() / len(test_df)

(0.4998030112550856, 0.49845480120289914, 0.5014620693478201)

In [224]:
len(train_id) / len(df), len(valid_id) / len(df), len(test_id) / len(df)

(0.6999986141522769, 0.10000138584772306, 0.2)

In [225]:
train_df.reset_index(inplace=True, drop=True)
valid_df.reset_index(inplace=True, drop=True)
test_df.reset_index(inplace=True, drop=True)

In [226]:
!pwd

/notebook/poison/poisonattack/DataPreprocessing

In [227]:
train_df.to_csv('../../data/processed_raif/train.csv')
valid_df.to_csv('../../data/processed_raif/valid.csv')
test_df.to_csv('../../data/processed_raif/test.csv')